In [5]:
import pandas as pd

obj1 = pd.Series(['a','b','c','d'])

print(obj1)

0    a
1    b
2    c
3    d
dtype: object

In [4]:
import pandas as pd

obj1 = pd.Series(['a','b','c','d'],index=[10,11,12,13])

print(obj1)

10    a
11    b
12    c
13    d
dtype: object

In [8]:
import pandas as pd

obj1 = pd.Series(['a','b','c','d'],index=[10,11,12,13])

print(obj1,"\n\t\t\t======")

obj2 = pd.Series({"ID":1850086,"Name":"Sarfraz","Father Name":"Aslam"})
print(obj2)

10    a
11    b
12    c
13    d
dtype: object
			======
ID             1850086
Name           Sarfraz
Father Name      Aslam
dtype: object

In [10]:
print(obj2.index)
print(obj2.values)

Index(['ID', 'Name', 'Father Name'], dtype='object')
[1850086 'Sarfraz' 'Aslam']

In [13]:
obj2.name = "Sarfraz data"
obj2.index.name = "Index"

print(obj2)

Index
ID             1850086
Name           Sarfraz
Father Name      Aslam
Name: Sarfraz data, dtype: object

In [16]:

obj1[10] = 'z'
obj1[10]

'z'

In [26]:
import pandas as pd

obj11 = pd.Series([1,2,3,4,5,6])

print(obj11 >5,"\n\n======")
print(obj11 *2,"\n\n======")
print(obj11[obj11 >5],"\n\n======")

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

======
0     2
1     4
2     6
3     8
4    10
5    12
dtype: int64

======
5    6
dtype: int64

======

In [28]:
'e' in obj11

False

In [29]:
pd.isnull(obj11)

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [30]:
import pandas as pd
sdata = [10,15,20,25,30,35]
sindex = ["ten","fifteen","twenty","twenty-five","thirty","thirty-five"]
new = pd.Series(sdata,index=sindex)
print(new)

ten            10
fifteen        15
twenty         20
twenty-five    25
thirty         30
thirty-five    35
dtype: int64

In [32]:
pd.notnull(obj11)

0    True
1    True
2    True
3    True
4    True
5    True
dtype: bool

In [33]:
#Dataframe
import numpy as np
import pandas as pd

In [42]:
frame1 = pd.DataFrame({
    "Day": [1,2,3,4,5],
    "Temperature" : [20,10,15,18,16],
    "Windy" : [30,40,45,35,50],
    "Rainy" : [True,False,False,True,False]
})
#frame1.index.name = "Index"
frame1

   Day  Temperature  Windy  Rainy
0    1           20     30   True
1    2           10     40  False
2    3           15     45  False
3    4           18     35   True
4    5           16     50  False

In [43]:
frame2 = pd.DataFrame([
    {"Day":1 , "Temp": 23, "Windy":34},
    {"Day":2 , "Temp": 33, "Windy":40},
])

frame2

   Day  Temp  Windy
0    1    23     34
1    2    33     40

In [44]:
frame3 = pd.DataFrame([
    (1,33,23),
    (2,28,43),
    (3,32,43),
],columns = ['Days',"Temp","Windy"])

frame3

   Days  Temp  Windy
0     1    33     23
1     2    28     43
2     3    32     43

In [46]:
frame4 = pd.read_excel('EMail List first.xlsx')
frame4

      Unnamed: 0                           Unnamed: 1
0            NaN                                  NaN
1            NaN           aamirpasha.pasha@gmail.com
2            NaN             abdulmananhere@gmail.com
3            NaN                   adozdias@gmail.com
4            NaN                   aeirc.pk@gmail.com
...          ...                                  ...
1550         NaN             shaheenmubarik@gmail.com
1551         NaN                  smmjilani@gmail.com
1552         NaN                  soomrogcu@gmail.com
1553         NaN               umargorsi015@gmail.com
1554         NaN  worldlafarmaciainpakistan@gmail.com

[1555 rows x 2 columns]

In [49]:
frame5 = pd.read_csv('FL_insurance_sample.csv')
frame5

   policyID  statecode  county  eq_site_limit  hu_site_limit
0  policyID  statecode  county  eq_site_limit  hu_site_limit

In [52]:
frame6 = pd.read_excel('demo.xlsx')
frame6

,s.no,Date,Patient Name,Product,Quantity,Price,Allowance
0,1,2019-09-03,Akhtar Mr...,Previr 0.5 mg,1,2000,300
1,2,2019-09-05,Baloch Khan Mr.,Previr 0.5 mg,1,2000,300
2,3,2019-09-06,Johar Ali Mr Dr.Dilpat,Previr 0.5 mg,1,2000,300
3,4,2019-09-02,Masroor Mr Dr.Dilpat,Previr 0.5 mg,2,2500,500
4,5,2019-09-17,Muhammad Faheem Mr Dr.Dilpat,Previr 0.5 mg,1,2500,500
5,6,2019-09-11,Rashid Ali Mr..,Previr 0.5 mg,1,2000,300
6,7,2019-09-26,Sajid Ali Mr Dr.Dilpat,Previr 0.5 mg,1,2000,300
7,8,2019-09-30,Zarswa Mrs,Previr 0.5 mg,1,2500,500

In [53]:
frame11 = pd.DataFrame({
    "Day": [1,2,3,4,5],
    "Temperature" : [20,10,15,18,16],
    "Windy" : [30,40,45,35,50],
    "Rainy" : [True,False,False,True,False]
})
frame11.to_excel('student.xlsx',sheet_name='sheetData')
frame1

   Day  Temperature  Windy  Rainy
0    1           20     30   True
1    2           10     40  False
2    3           15     45  False
3    4           18     35   True
4    5           16     50  False

In [59]:
frame7 = pd.read_excel('demo.xlsx')
frame7[['Product','Price','Allowance']]

         Product  Price  Allowance
0  Previr 0.5 mg   2000        300
1  Previr 0.5 mg   2000        300
2  Previr 0.5 mg   2000        300
3  Previr 0.5 mg   2500        500
4  Previr 0.5 mg   2500        500
5  Previr 0.5 mg   2000        300
6  Previr 0.5 mg   2000        300
7  Previr 0.5 mg   2500        500

In [60]:
frame7.index

RangeIndex(start=0, stop=8, step=1)

In [63]:
frame7.head()

,s.no,Date,Patient Name,Product,Quantity,Price,Allowance
0,1,2019-09-03,Akhtar Mr...,Previr 0.5 mg,1,2000,300
1,2,2019-09-05,Baloch Khan Mr.,Previr 0.5 mg,1,2000,300
2,3,2019-09-06,Johar Ali Mr Dr.Dilpat,Previr 0.5 mg,1,2000,300
3,4,2019-09-02,Masroor Mr Dr.Dilpat,Previr 0.5 mg,2,2500,500
4,5,2019-09-17,Muhammad Faheem Mr Dr.Dilpat,Previr 0.5 mg,1,2500,500

In [64]:
frame7.head(3)

,s.no,Date,Patient Name,Product,Quantity,Price,Allowance
0,1,2019-09-03,Akhtar Mr...,Previr 0.5 mg,1,2000,300
1,2,2019-09-05,Baloch Khan Mr.,Previr 0.5 mg,1,2000,300
2,3,2019-09-06,Johar Ali Mr Dr.Dilpat,Previr 0.5 mg,1,2000,300

In [66]:
frame7.tail()

,s.no,Date,Patient Name,Product,Quantity,Price,Allowance
3,4,2019-09-02,Masroor Mr Dr.Dilpat,Previr 0.5 mg,2,2500,500
4,5,2019-09-17,Muhammad Faheem Mr Dr.Dilpat,Previr 0.5 mg,1,2500,500
5,6,2019-09-11,Rashid Ali Mr..,Previr 0.5 mg,1,2000,300
6,7,2019-09-26,Sajid Ali Mr Dr.Dilpat,Previr 0.5 mg,1,2000,300
7,8,2019-09-30,Zarswa Mrs,Previr 0.5 mg,1,2500,500

In [67]:
frame7.tail(1)

   s.no       Date Patient Name        Product  Quantity  Price  Allowance
7     8 2019-09-30   Zarswa Mrs  Previr 0.5 mg         1   2500        500

In [69]:
frame7.columns

Index(['s.no', 'Date', 'Patient Name', 'Product', 'Quantity', 'Price',
       'Allowance'],
      dtype='object')

In [70]:
frame7.Price

0    2000
1    2000
2    2000
3    2500
4    2500
5    2000
6    2000
7    2500
Name: Price, dtype: int64

In [71]:
frame7['Price'].max()

2500

In [72]:
frame7['Price'].min()

2000

In [73]:
frame7['Price'].mean()

2187.5

In [74]:
frame7.describe()

          s.no  Quantity        Price   Allowance
count  8.00000  8.000000     8.000000    8.000000
mean   4.50000  1.125000  2187.500000  375.000000
std    2.44949  0.353553   258.774585  103.509834
min    1.00000  1.000000  2000.000000  300.000000
25%    2.75000  1.000000  2000.000000  300.000000
50%    4.50000  1.000000  2000.000000  300.000000
75%    6.25000  1.000000  2500.000000  500.000000
max    8.00000  2.000000  2500.000000  500.000000

In [75]:
frame7.loc[4]

s.no                                       5
Date                     2019-09-17 00:00:00
Patient Name    Muhammad Faheem Mr Dr.Dilpat
Product                        Previr 0.5 mg
Quantity                                   1
Price                                   2500
Allowance                                500
Name: 4, dtype: object

In [76]:
del frame5['hu_site_limit']
frame5

   policyID  statecode  county  eq_site_limit
0  policyID  statecode  county  eq_site_limit

In [77]:
#Transpose convert the row into column and columns into row
frame4.T

,0,1,2,3,4,5,6,7,8,9,...,1545,1546,1547,1548,1549,1550,1551,1552,1553,1554
Unnamed: 0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Unnamed: 1,NaN,aamirpasha.pasha@gmail.com,abdulmananhere@gmail.com,adozdias@gmail.com,aeirc.pk@gmail.com,alikhokhar933@gmail.com,aljassarksa@gmail.com,amdadali537@gmail.com,ameel.khan@gmail.com,anieezakir12@gmail.com,...,mihsmultan@gmail.com,piopid@gmail.com,prof.fakhar@gmail.com,rabiasaif03@gmail.com,ranababar488@gmail.com,shaheenmubarik@gmail.com,smmjilani@gmail.com,soomrogcu@gmail.com,umargorsi015@gmail.com,worldlafarmaciainpakistan@gmail.com

In [78]:
frame11

   Day  Temperature  Windy  Rainy
0    1           20     30   True
1    2           10     40  False
2    3           15     45  False
3    4           18     35   True
4    5           16     50  False

In [79]:
frame11[['Temperature','Windy']][frame11['Rainy']==True]

   Temperature  Windy
0           20     30
3           18     35

In [80]:
frame11[frame11['Temperature']>19]

   Day  Temperature  Windy  Rainy
0    1           20     30   True

In [87]:
frame11[frame11['Temperature']==18]

   Day  Temperature  Windy  Rainy
3    4           18     35   True

In [88]:
frame11.shape

(5, 4)

In [89]:
row,columns =frame11.shape
row

5

In [90]:
row,columns =frame11.shape
columns

4

In [92]:
#Slicing
frame11[0:3]

   Day  Temperature  Windy  Rainy
0    1           20     30   True
1    2           10     40  False
2    3           15     45  False

In [93]:
frame11.sort_values(by='Temperature')

   Day  Temperature  Windy  Rainy
1    2           10     40  False
2    3           15     45  False
4    5           16     50  False
3    4           18     35   True
0    1           20     30   True

In [95]:
#Slicing
frame11[-5:-2]

   Day  Temperature  Windy  Rainy
0    1           20     30   True
1    2           10     40  False
2    3           15     45  False

In [101]:
frame33 = pd.DataFrame(np.random.randn(4, 4),index =pd.date_range('20200101',periods=4),columns=list('ABCD'))
frame33

                   A         B         C         D
2020-01-01 -0.325522  1.084341  0.382041  0.247584
2020-01-02 -1.301490  0.613632 -0.847346 -0.657848
2020-01-03 -0.335595 -0.187283 -0.588263  0.769945
2020-01-04 -1.210709 -1.644612 -0.141096 -0.153973

In [107]:
frame34 = pd.DataFrame(np.random.randn(4, 4),index =pd.date_range('20200105',periods=4),columns=list('ABCD'))
frame34

                   A         B         C         D
2020-01-05 -1.394191  0.172426 -0.894084 -0.734415
2020-01-06 -0.908507 -0.468299  1.617768  0.214566
2020-01-07 -2.258305 -0.498470 -1.921408 -3.160829
2020-01-08 -0.769463 -0.351386 -0.398690  0.460968

In [112]:
frame33 * frame34

             A   B   C   D
2020-01-01 NaN NaN NaN NaN
2020-01-02 NaN NaN NaN NaN
2020-01-03 NaN NaN NaN NaN
2020-01-04 NaN NaN NaN NaN
2020-01-05 NaN NaN NaN NaN
2020-01-06 NaN NaN NaN NaN
2020-01-07 NaN NaN NaN NaN
2020-01-08 NaN NaN NaN NaN

In [111]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],   
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8